Управление_закупками/src/AccumulationRegisters/ОстатокТовараПоСчету/ОстатокТовараПоСчету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстатокТовараПоСчету</name>
  <resources>
    <name>КоличествоЗакрытоеПоСчету</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗакрытоеПотребности</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныеХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетКонтрагента</name>
    <type>
      <types>DocumentRef.СчетКонтрагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияПоставщика</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_закупками/src/AccumulationRegisters/ОстатокТовараПоСчету/Forms/ФормаСпискаПозицияПодробно/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("ВнутреннийЗаказ") Тогда 	
			ВнутреннийЗаказ = Параметры.Отбор.ВнутреннийЗаказ;	
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("Номенклатура") Тогда 	
			Номенклатура = Параметры.Отбор.Номенклатура;
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ДополнительныеХарактеристикиНоменклатуры") Тогда	
			ДополнительныеХарактеристикиНоменклатуры = Параметры.Отбор.ДополнительныеХарактеристикиНоменклатуры;
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ЕдиницаИзмерения") Тогда	
			ЕдиницаИзмерения = Параметры.Отбор.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
